nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/common/pin_mux/cm33/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXL255
package_id: MCXL255VDF
mcu_data: ksdk2_0
processor_version: 0.2603.90
pin_labels:
- {pin_num: D3, pin_signal: P1_16/FREQME_CLK_IN1/LPI2C0_HREQ/LPSPI1_SCK/UTICK_CAP2/TRIG_OUT5/CT1_MAT1/SLCD_10/WUU_P6, label: LED_GREEN, identifier: LED_GREEN}
- {pin_num: R3, pin_signal: P2_12/TRIG_IN0/LPI2C0_SCL/LPSPI0_SCK/LPUART1_RTS_B/TRIG_OUT2/CT1_MAT2/SLCD_52, label: LED_BLUE, identifier: LED_BLUE}
- {pin_num: C3, pin_signal: P1_15/FREQME_CLK_IN0/LPSPI1_SDO/UTICK_CAP1/TRIG_OUT4/CT1_MAT0/SLCD_9, label: LED_RED, identifier: LED_RED}
- {pin_num: A1, pin_signal: P1_13/TRIG_IN18/LPI2C1_SCL/LPUART0_RTS_B/CT2_MAT0/SLCD_7, label: 'P1_13/U18[6]'}
- {pin_num: B1, pin_signal: P1_14/TRIG_IN19/LPI2C1_SDA/LPUART0_CTS_B/CT2_MAT1/SLCD_8/WUU_P5, label: P1_14, identifier: SW2}
- {pin_num: D1, pin_signal: P1_18/TRIG_IN1/LPI2C1_SCL/LPSPI1_SCK/TRIG_OUT1/CT0_MAT0/SLCD_12, label: 'P1_18/J2[12]/J3[13]', identifier: LPSPI1_SCK}
- {pin_num: F1, pin_signal: P1_20/TRIG_IN3/LPUART1_RXD/LPSPI1_PCS0/TRIG_OUT3/CT0_MAT2/SLCD_14/WUU_P10, label: 'P1_20/J2[6]', identifier: LPSPI1_PCS0}
- {pin_num: H1, pin_signal: P2_1/FREQME_CLK_IN1/LPUART0_TXD/LPSPI0_SCK/TRIG_IN14/CT1_MAT1/SLCD_18/HSADC0_A15, label: 'P2_1/J1[3]/J2[5]', identifier: LPSPI0_SCK}
- {pin_num: K1, pin_signal: P2_5/TRIG_IN9/LPI2C1_SDA/LPUART1_RXD/UTICK_CAP1/TRIG_OUT1/CT2_MAT0/SLCD_51/WUU_P13, label: 'P2_5/U18[19]'}
- {pin_num: M1, pin_signal: P2_7/TRIG_IN11/TRIG_OUT3/CT2_MAT2/SLCD_22, label: 'P2_7/U18[4]'}
- {pin_num: T1, pin_signal: P2_13/TRIG_IN1/LPI2C0_SDA/LPSPI0_SDI/LPUART1_CTS_B/TRIG_OUT3/CT1_MAT3/SLCD_53/WUU_P16, label: 'P2_13/U18[15]'}
- {pin_num: U1, pin_signal: P2_14/TRIG_IN2/LPI2C0_HREQ/LPSPI0_PCS0/TRIG_OUT4/CT2_MAT0/SLCD_27/WUU_P17/HSADC0_A11, label: 'P2_14/J1[12]'}
- {pin_num: A2, pin_signal: P1_12/TRIG_IN19/TRIG_OUT2/CT0_MAT2/SLCD_6, label: 'P1_12/U18[5]'}
- {pin_num: B2, pin_signal: P1_11/TRIG_IN19/LPI2C0_SDA/TRIG_OUT7/SLCD_49/WUU_P8, label: 'P1_11/U18[17]'}
- {pin_num: D2, pin_signal: P1_17/TRIG_IN0/LPI2C1_HREQ/LPSPI1_SDO/TRIG_OUT0/ACMP0_OUT/SLCD_11/WUU_P7, label: 'P1_17/J2[8]', identifier: LPSPI1_SDO}
- {pin_num: F2, pin_signal: P1_21/TRIG_IN4/LPUART1_TXD/LPSPI1_PCS1/TRIG_OUT4/CT0_MAT3/SLCD_15, label: 'P1_21/U18[2]'}
- {pin_num: G2, pin_signal: P1_22/TRIG_IN5/LPUART1_RTS_B/UTICK_CAP3/TRIG_OUT5/SLCD_16/HSADC0_A17, label: 'P1_22/U18[3]'}
- {pin_num: H2, pin_signal: P2_0/FREQME_CLK_IN0/LPUART0_RXD/LPSPI0_SDO/TRIG_IN13/CT1_MAT0/SLCD_17/WUU_P11/HSADC0_A16, label: 'P2_0/J2[3]/J4[9]', identifier: LPSPI0_SDO}
- {pin_num: P2, pin_signal: P2_10/FREQME_CLK_IN0/LPUART0_RXD/LPSPI0_PCS1/LPUART1_RXD/TRIG_OUT0/CT1_MAT0/SLCD_25/WUU_P15, label: 'LPUART0_RXD/JP16[1]', identifier: LPUART0_RXD}
- {pin_num: T2, pin_signal: P2_16/TRIG_IN6/LPI2C1_SDA/LPUART0_CTS_B/SLCD_55/WUU_P19/ACMP0_IN2, label: 'P2_16/U18[20]'}
- {pin_num: B3, pin_signal: P1_10/TRIG_IN18/LPI2C0_SCL/UTICK_CAP3/TRIG_OUT6/SLCD_48, label: 'P1_10/U18[16]'}
- {pin_num: F3, pin_signal: P1_19/TRIG_IN2/LPI2C1_SDA/LPSPI1_SDI/TRIG_OUT2/CT0_MAT1/SLCD_13/WUU_P9, label: 'P1_19/J2[10]/J3[15]', identifier: LPSPI1_SDI}
- {pin_num: H3, pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPSPI0_SDI/LPI2C1_SCLS/TRIG_OUT6/CT1_MAT2/SLCD_19/HSADC0_A14, label: 'P2_2/J2[15]/J4[1]', identifier: LPSPI0_SDI}
- {pin_num: J3, pin_signal: P2_3/TRIG_IN7/LPUART0_CTS_B/LPSPI0_PCS0/LPI2C1_SDAS/TRIG_OUT6/CT1_MAT3/SLCD_20/WUU_P12/HSADC0_A13, label: 'P2_3/J2[17]/J4[3]', identifier: LPSPI0_PCS0}
- {pin_num: K3, pin_signal: P2_4/TRIG_IN8/LPI2C1_SCL/LPSPI0_PCS1/UTICK_CAP0/TRIG_OUT0/ACMP0_OUT/SLCD_50, label: 'P2_4/U18[18]'}
- {pin_num: P3, pin_signal: P2_11/FREQME_CLK_IN1/LPUART0_TXD/LPSPI0_SDO/LPUART1_TXD/TRIG_OUT1/CT1_MAT1/SLCD_26, label: 'LPUART0_TXD/JP19[1]', identifier: LPUART0_TXD}
- {pin_num: A4, pin_signal: P1_8/TRIG_IN16/LPI2C0_SCLS/LPUART0_RXD/LPSPI1_SDO/CT2_MAT3/SLCD_4/WUU_P4, label: 'P1_8/J2[13]/U19[5]', identifier: LPSPI1_SDO}
- {pin_num: B4, pin_signal: P1_9/TRIG_IN17/LPI2C0_SDAS/LPUART0_TXD/LPSPI1_SCK/SLCD_5, label: 'P1_9/J1[13]/U19[6]', identifier: LPSPI1_SCK}
- {pin_num: C4, pin_signal: P1_7/TRIG_IN15/LPI2C0_SDA/LPUART1_CTS_B/LPSPI1_PCS0/LPUART0_TXD/CT2_MAT2/SLCD_3/WUU_P3, label: 'P1_7/J2[4]/U19[1]', identifier: LPSPI1_PCS0}
- {pin_num: T4, pin_signal: P2_18/TRIG_IN4/LPI2C0_SDAS/LPUART0_TXD/TRIG_OUT6/CT2_MAT2/SLCD_29/HSADC0_A9, label: 'P2_18/J1[5]/J3[11]/J4[4]'}
- {pin_num: U4, pin_signal: P2_19/SLCD_30, label: 'P2_19/U18[7]'}
- {pin_num: C5, pin_signal: P1_6/TRIG_IN19/LPI2C0_SCL/LPUART1_RTS_B/LPSPI1_SDI/LPUART0_RXD/CT2_MAT1/SLCD_2, label: 'P1_6/J2[2]/U19[2]', identifier: LPSPI1_SDI}
- {pin_num: T6, pin_signal: P2_21/TRIG_IN14/LPSPI0_PCS1/LPI2C1_SCL/TRIG_OUT4/CT2_MAT0/SLCD_39/ACMP0_IN1, label: 'P2_21/U18[13]'}
- {pin_num: U6, pin_signal: P2_20/SLCD_31, label: 'P2_20/U18[8]'}
- {pin_num: T7, pin_signal: P2_22/TRIG_IN15/LPSPI0_SDO/LPI2C1_SDA/LPUART0_RXD/TRIG_OUT5/CT0_MAT0/SLCD_40/WUU_P20/ACMP0_IN0, label: 'P2_22/J2[11]'}
- {pin_num: C8, pin_signal: P1_0/TRIG_IN13/LPI2C1_SCL/TRIG_OUT0/CT2_MAT0/SLCD_46, label: 'P1_0/U18[14]'}
- {pin_num: R8, pin_signal: P2_25/CLKOUT/LPSPI0_PCS0/LPI2C0_SDA/LPUART0_CTS_B/TRIG_OUT7/CT0_MAT3/SLCD_43/WUU_P22, label: 'LPI2C0_SDA/U16[4]', identifier: LPI2C0_SDA}
- {pin_num: U8, pin_signal: P2_24/TRIG_IN16/LPSPI0_SDI/LPI2C0_SCL/LPUART0_RTS_B/TRIG_OUT6/CT0_MAT2/SLCD_42, label: 'LPI2C0_SCL/U16[5]', identifier: LPI2C0_SCL}
- {pin_num: A10, pin_signal: P0_17/TDI/AON_LPI2C0_SDA/KPP_ROW_3/LPTMR0_ALT3/QTMR1_OUT0/AONTRIG_IN7/KPP_ROW_7, label: 'P0_17/J8[17]/U17[2]/U7[6]', identifier: AON_LPI2C0_SDA}
- {pin_num: B10, pin_signal: P0_16/TDO/SWO/AON_LPI2C0_SCL/KPP_ROW_2/LPTMR0_ALT2/QTMR0_OUT0/AONTRIG_IN6/KPP_ROW_6, label: 'P0_16/J8[19]/U17[3]/U11[4]', identifier: AON_LPI2C0_SCL}
- {pin_num: A12, pin_signal: P0_13/AONTRIG_IN5/AON_LPI2C0_SDA/KPP_ROW_1/LPTMR0_ALT3/QTMR1_OUT1/LPACMP_OUT/LCSensePushPullALT0_CH1/LCSenseTristateALT0_CH1/KPP_ROW_5/AON_LPADC0_A3,
  label: 'P0_13/J2[7]/J3[7]/J8[3]', identifier: AON_LPI2C0_SDA}
- {pin_num: R12, pin_signal: P3_1/TRIG_IN12/LPI2C1_SDA/LPUART1_TXD/UTICK_CAP1/TRIG_OUT2/CT1_MAT0/HSADC0_A4, label: 'P3_1/J4[10]', identifier: LPI2C1_SDA}
- {pin_num: U12, pin_signal: P3_0/TRIG_IN11/LPI2C1_SCL/LPUART1_RXD/UTICK_CAP0/TRIG_OUT1/CT0_MAT1/HSADC0_A7/VREFI, label: 'P3_0/J4[12]', identifier: LPI2C1_SCL}
- {pin_num: B14, pin_signal: P0_10/AONTRIG_IN2/AONCMP0_OUT/AON_LPACMP_IN_4/AON_LPADC0_A2, label: 'P0_10/J3[3]/J8[16]/U16[8]'}
- {pin_num: C14, pin_signal: P0_12/AONTRIG_IN4/AON_LPI2C0_SCL/KPP_ROW_0/LPTMR0_ALT2/QTMR1_OUT0/LPACMP_OUT/LCSensePushPullALT0_CH2/LCSenseTristateALT0_CH2/KPP_ROW_4/AON_ACMP0_IN4/AON_LPADC0_A0,
  label: 'P0_12/J2[9]/J3[5]/J8[5]', identifier: AON_LPI2C0_SCL}
- {pin_num: P14, pin_signal: P3_15/TRIG_OUT3/LPUART0_TXD/LPUART1_RTS_B/SLCD_38, label: 'P3_15/U18[12]'}
- {pin_num: T14, pin_signal: P3_5/TRIG_IN7/LPUART1_TXD/SLCD_41, label: 'P3_5/J1[7]/U18[9]'}
- {pin_num: B15, pin_signal: P0_9/AONTRIG_IN1/AON_LPUART0_RX/KPP_COL_3/LCSensePushPullALT0_CH3/LCSenseTristateALT0_CH3/KPP_COL_5, label: 'P0_9/J8[20]', identifier: SW5}
- {pin_num: P15, pin_signal: P3_12/TRIG_IN15/LPI2C0_SCL/LPSPI0_SDO/LPUART1_RTS_B/LPUART0_RTS_B/CT0_MAT0/SLCD_44, label: 'P3_12/U15[8]', identifier: LPI2C0_SCL}
- {pin_num: T15, pin_signal: P3_6/TRIG_IN8/LPUART1_RTS_B/SLCD_33, label: 'P3_6/U18[10]'}
- {pin_num: F16, pin_signal: P0_2/AONTRIG_IN0/AON_LPI2C0_SCL/KPP_COL_0/LPTMR0_ALT2/QTMR0_OUT2/LCSenseCMP_CH1/AON_LPACMP_IN_1/AON_ACMP0_IN1, label: 'P0_2/J8[8]'}
- {pin_num: P16, pin_signal: P3_13/TRIG_IN16/LPI2C0_SDA/LPSPI0_SCK/LPUART1_CTS_B/LPUART0_CTS_B/CT0_MAT1/SLCD_45/WUU_P25, label: 'P3_13/U15[1]', identifier: LPI2C0_SDA}
- {pin_num: T16, pin_signal: P3_7/TRIG_IN9/LPUART1_CTS_B/SLCD_34/WUU_P24, label: 'P3_7/U18[11]'}
- {pin_num: F17, pin_signal: P0_3/AONTRIG_IN1/AON_LPI2C0_SDA/KPP_COL_1/LPTMR0_ALT1/QTMR0_OUT3/LCSenseCMP_CH2/AON_LPACMP_IN_2/AON_ACMP0_IN2, label: 'P0_3/J3[1]/J8[4]'}
- {pin_num: P17, pin_signal: P3_14/TRIG_OUT2/LPUART0_RXD/LPI2C1_HREQ/LPUART1_CTS_B/SLCD_1/WUU_P27, label: 'P3_14/U18[1]'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

